trunk/eid-pki-ra-client-xkms/src/test/resources/exampleSigningRequest.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"><Body><BulkRegister xmlns="http://www.w3.org/2002/03/xkms-xbulk" xmlns:ns2="http://xkms.ubizen.com/kitoshi" xmlns:ns3="http://www.xkms.org/schema/xkms-2001-01-20" xmlns:ns4="http://www.w3.org/2000/09/xmldsig#"><SignedPart Id="signed-part"><BatchHeader><BatchID>batch-id-3593b2bc-aca7-429c-abca-055b4f9c0e0a</BatchID><BatchTime>2010-12-03T11:54:16.074Z</BatchTime><NumberOfRequests>1</NumberOfRequests></BatchHeader><ns3:Respond><ns3:string>RetrievalMethod</ns3:string><ns3:string>X509Cert</ns3:string></ns3:Respond><Requests number="1"><Request><ns3:Status>Valid</ns3:Status><ns3:KeyID>key-id-6c7676b1-3adf-4ef8-b258-5eb01a7493c7</ns3:KeyID><ns4:KeyInfo><ns4:KeyName>http://xkms.og.ubizen.com/keyname?buc_id=8047651269</ns4:KeyName><PKCS10>MIIBqDCCARECAQAwaDELMAkGA1UEBhMCQkUxEDAOBgNVBAgTB0xpbWJ1cmcxEDAOBgNVBAcTB0hhc3NlbHQxGTAXBgNVBAoTEEFDQSBJVC1Tb2x1dGlvbnMxGjAYBgNVBAMTEUphbiBWYW4gZGVuIEJlcmdoMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCl9kIB3oD4AO4RBICIW8jkXXc/alX0cRHb+BrorI8g95eaN15VV4WTXsaw+Kx67xn8QkjgrI76z2dTaBhgaTFdzxYNO4Pqt+ajKGV4BP0Lquh7qyO1k/IT/KyyAdlHbJq8VD+Od/AnknnQminCw1TEPZfFck+HGGCvRrSeflRaXwIDAQABoAAwDQYJKoZIhvcNAQEFBQADgYEAJTlkGaB4CQIiZ+RP6NFYqe23ZpkU2GpSbUNJRGd7+a7RHQxodGQjZWpctP14R3C0iBHi6G8C7E5zhHWRyFtzxT3MVBFH33kuHxcRkAlDKZNAWyu8/pH4Z3DIUVriyhH2pUweqSXaaAaqmgocOH7vJzXLQ3WpNR1UsC/69kNpmpE=</PKCS10></ns4:KeyInfo><ProcessInfo><ns2:Publish>true</ns2:Publish><ns2:AttributeCertificate><ns2:ValidityInterval><ns2:NotBefore>2010-12-03T11:59:16.072Z</ns2:NotBefore><ns2:NotAfter>2012-03-03T11:59:16.072Z</ns2:NotAfter></ns2:ValidityInterval></ns2:AttributeCertificate></ProcessInfo></Request></Requests></SignedPart><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#signed-part"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>myOd1ZrjEPFLRSoOsP42xB59ybU=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>d6JjDLP9D5R/TOvHvTA4duMIEAXA88b7IVfqs/7kXp1qvV34X4RUP9oUYGF5yka1No5hzkKRy2e5
wEclOX2A+lIb/l8j9Y7YuNCnt0DKE8UOgq8Pdo89aZiY9+OzDD1oqvQedZ5djnx134emfF8lmZLN
cYeBLaU9ZY2k0uw1Ors=</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509SubjectName>CN=Test User, OU=Unknown, O=Test, L=Unknown, ST=Unknown, C=BE</ds:X509SubjectName><ds:X509Certificate>MIICQzCCAaygAwIBAgIES7w8GTANBgkqhkiG9w0BAQUFADBmMQswCQYDVQQGEwJCRTEQMA4GA1UE
CBMHVW5rbm93bjEQMA4GA1UEBxMHVW5rbm93bjENMAsGA1UEChMEVGVzdDEQMA4GA1UECxMHVW5r
bm93bjESMBAGA1UEAxMJVGVzdCBVc2VyMB4XDTEwMDQwNzA4MDIzM1oXDTEwMDcwNjA4MDIzM1ow
ZjELMAkGA1UEBhMCQkUxEDAOBgNVBAgTB1Vua25vd24xEDAOBgNVBAcTB1Vua25vd24xDTALBgNV
BAoTBFRlc3QxEDAOBgNVBAsTB1Vua25vd24xEjAQBgNVBAMTCVRlc3QgVXNlcjCBnzANBgkqhkiG
9w0BAQEFAAOBjQAwgYkCgYEAzi24NHmrqpD4Rse4qLJ9eBrxvfglc8Ul31lhOL4huFuqjQsHEYvC
0xZazb4IExKgrybvWJGWkzu3NSoOKOyVq7Vfaq0F2Q2cuoxTI7H5PqO6yPRv9bOkYPweZnec10Di
TRalK5klI1r+HlG2g+tjn4zaL5BQdy1bMVnqvZuYb4sCAwEAATANBgkqhkiG9w0BAQUFAAOBgQAA
p3WILq3q/uABFp4fx3JLlghMSdRlzB1HFWTShTYgsKqKN0MQDfOWm3TgQ1Q0xnAv2anfWN2Q25/o
OEcGPR6gwQ9RU6dC4/OuuV61vwJzCnHXePFBcu+JvZuShFYQ3L+DDHII/4OMTG3EMKtQckm/EQFJ
+7zH5c8tyPBlrgbhpg==</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></BulkRegister></Body></Envelope>
